Repository: shivasangarimalavarayan/Ainkurunuru_Vellankurugupathu_Tranalation
Catalog: project_save.tmx
Source language: ta
Languages: en_in

source: வெள்ளாங் குருகின் பிள்ளை செத்து எனக்
en_in: as the chick of the white heron died

source: பொய்க்கும் இவ்வூரே.
en_in: people in this town are saying lies

source: அம் மா மேனி எம் தோழியது துயரே.
en_in: beautiful dark complexion girl, our friend's sorrow

source: அறவன் போலும் அருளுமார் அதுவே.
en_in: he appears to be noble also his grace it is

source: உளர ஒழிந்த தூவி குலவுமணல்
en_in: as it preened it lost its feathers on the sand heap

source: எனக்கோ காதலன், அனைக்கோ வேறே.
en_in: for me, he seems to be loving her but she assumes differently

source: ஓதமொடு பெயரும் துறைவற்குப்,
en_in: they moved along the waves of the backwaters, for the lord of the seashore

source: கள்கமழ்ந்து ஆனத் துறைவற்கு
en_in: for the lord of the shore, where the everlasting nectar fragnance of water lilies lingers,

source: கள்கமழ்ந்து ஆனாத் துறைவற்கு
en_in: to the lord of the shore where the scent of water lillie's unending nectar fragnance lingers

source: காணிய சென்ற மட நடை நாரை
en_in: the soft-stepping stork went to see it

source: காணிய சென்ற மடநடை நாரை
en_in: the soft-stepping stork went to see it

source: கானலம் பெருந்துறைத் துணையொடு கொட்கும்
en_in: roam with its companion in the big port's groves,

source: கானல் சேக்கும் துறைவனோடு
en_in: stay in the seashore grove, the lord of the shore

source: காலை இருந்து மாலைச் சேக்கும்,
en_in: stays from morning until evening

source: கையறுபு இரற்றும் கானலம் புலம்பந்
en_in: it cried helplessly in a seashore groves

source: தண்ணந் துறைவன் கண்டிகும்,
en_in: the lord of the cool shore, you should see

source: தந்தனை சென்மோ கொண்ட இவள் நலனே.
en_in: give back her virtues which you took and leave

source: தான் வந்தனன், எம் காதலோனே.
en_in: he came alone, my beloved son

source: துறைவன் வரையும் என்ப
en_in: they say he, the lord of that seashore will marry her

source: தெண் கழிப் பரக்குந் துறைவன்,
en_in: they spread in the clear backwaters, the lord of the shore

source: தெண் கடல் சேர்ப்பனொடு வாரான்,
en_in: in the clear sea, he did not come with the lord of the shore

source: நன்னெடுங் கூந்தல் நாடுமோ மற்றே.
en_in: wil the girl with long luscious hair ever seek

source: நின் ஒன்று இரக்குவென் அல்லேன்,
en_in: i will never beg you even for a thing

source: நெக்க நெஞ்சம் நேர்கல் லேனே.
en_in: my broken heart will no longer yield

source: நெக்க நெஞ்சம் நேர்கல் லேனே
en_in: my broken heart will no longer yield

source: நொந்ததன் தலையும் நோய் மிகும் துறைவ!
en_in: its distress is further burdening its grief, oh you lord of this seashore

source: பசி தின அல்கும் பனி நீர்ச் சேர்ப்ப
en_in: In spite of its hunger it stayed, oh the lord of cool waters

source: பண்டையின் மிகப் பெரிது இனைஇ
en_in: she is very much worried more than the past,

source: பதைப்ப ஒழிந்த செம்மறுத் தூவி
en_in: trembled and lost the feathers with red spots

source: பதைப்பத் ததைந்த நெய்தல் கழிய
en_in: trembled in agony, trampled the water lilly,

source: பாடல் 151 கூற்று: வாயில் வேண்டி வந்த தோழியிடம் தலைவி சொன்னது.
en_in: poem utterance: heroine said to her friend, who came as a hero's messanger.

source: பாடல் 152 கூற்று: ‘இவன் உன் மேல் அன்புடையவன் அருளுடையவன்’ எனக் கூறி வாயில் வேண்டிய தோழியிடம் தலைவி சொன்னது.
en_in: poem utterance: the heroine respond to her friend.

source: பாடல் 153 கூற்று: தோழி வாயில்களிடம் கூறியது.
en_in: poem utterance: friend of the heroine said to the messangers.

source: பாடல் 154 கூற்று: தலைவி தோழியிடம் சொன்னது
en_in: poem utterance:heroine to her friend

source: பாடல் 158 கூற்று: தோழி தலைவனிடம் சொன்னது
en_in: poem utterance : friend of the heroine said to the hero

source: பாடல் 156 கூற்று: தலைவனின் நண்பர்களிடம் தோழி சொன்னது.
en_in: friend of the heroine said to the hero's friends

source: பாடல் 157 கூற்று: தலைவி தனக்குள் சொன்னது
en_in: poem utterance: heroine said to herself

source: பாடல் 159 கூற்று: தோழி தலைவனிடம் கூறியது
en_in: poem utterance: friend of the heroine said to the hero

source: பாடல் 160 கூற்று: தலைவி தலைவனிடம் சொன்னது
en_in: poem utterance: heroine said to the hero.

source: பைஞ்சாய்ப் பாவை ஈன்றனென் யானே.
en_in: i gave a grass doll

source: போர்வின் பெறூஉம் துறைவன் கேண்மை
en_in: lord of shore's friendship

source: மிதிப்ப நக்க கண்போல் நெய்தல்
en_in: it stepped, the water lilies which resemble the eye blossomed

source: முயங்குமதி பெரும, மயங்கினள் பெரிதே.
en_in: embrace her lord, she is very confused

source: யானெவன் செய்கோ?
en_in: what i will do with him

source: வெள்ளாங்குருகின் பிள்ளை செத்து எனக்
en_in: as the chick of the white heron died
